app/controllers/dashboard_controller.rb

  def newStudents
    #generated_pass = Devise.friendly_token.first(4)
    generated_pass = rand(9999).to_s.center(4, rand(9).to_s)
    @user = User.create!({:name=>params[:name], :last_name =>params[:last_name], :email =>params[:email], :saldo =>params[:saldo], :codigo =>params[:codigo], :password => generated_pass})
---
INSERT INTO `users` (`name`, `last_name`, `codigo`, `saldo`, `email`, `encrypted_password`, `created_at`, `updated_at`) VALUES ('Juan', 'Gómez', 200035997, 10.0, 'jsantofimio@uninorte.edu.co', '$2a$11$hM.BbEZ9CdAaEW32K7dl/egAgwL7C3ssyFjn/bZFTBEHLKhqpCUN6', '2017-04-17 23:09:05', '2017-04-17 23:09:05')

  def editStudents
    @users = User.where(teacher: '0')
---
SELECT `users`.* FROM `users` WHERE `users`.`teacher` = '0'

  def editClasses
    #@out = SubjectNrc.joins(Subject.name) #funciona pero no une nada
    @out = SubjectNrc.connection.execute("SELECT s.id, s.name, n.id, n.nrc FROM subject_nrcs as n, subjects as s WHERE n.subject_id = s.id;")
    @classes_name = Subject.all()
---
SELECT `subjects`.* FROM `subjects`

  def addClasses
    # subir todo lo que se ingresa en el formulario
    class_nrc = SubjectNrc.new(:subject_id => params[:subject_id], :nrc => params[:NRC], :user_id => current_user.id)
    nrcindb = SubjectNrc.where({nrc: params[:NRC]})
    if(nrcindb.count==1)
      #nrcindb.update({:nrc => params[:NRC]})

    else
      class_nrc.save()
---
INSERT INTO `subject_nrcs` (`subject_id`, `nrc`, `user_id`, `created_at`, `updated_at`) VALUES (1, 4045, 1, '2017-05-08 01:38:42', '2017-05-08 01:38:42')

  def update_class
    @class =  SubjectNrc.where({ :id => params[:index]})
---
SELECT  `subject_nrcs`.* FROM `subject_nrcs` WHERE `subject_nrcs`.`id` = 2 ORDER BY `subject_nrcs`.`id` ASC LIMIT 1

  def update
   @user =  User.where({ :id => params[:index]})
   @user.update({params[:column] => params[:new]})
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `users` SET `last_name` = 'Gomez Santofimio', `updated_at` = '2017-04-16 07:52:50' WHERE `users`.`id` = 24

  def panel
    if current_user.teacher
      @count = SubjectNrc.where(:user_id => current_user.id).count
      @numbers = User.where(:teacher=>0).count
---
SELECT COUNT(*) FROM `subject_nrcs` WHERE `subject_nrcs`.`user_id` = 0
SELECT COUNT(*) FROM `users` WHERE `users`.`teacher` = 0

  def update_skin
    @user = User.find(current_user.id)
    @user.update({:skin => params[:skin]})
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `users` SET `skin` = 'skin-red', `updated_at` = '2017-04-16 07:53:10' WHERE `users`.`id` = 1

  def get_myskin
    @skin = User.select("skin").where({:id=>current_user.id})
---
SELECT `users`.`skin` FROM `users` WHERE `users`.`id` = 1

  def update_image
    @user = User.find(current_user.id)
    if @user.update(user_params)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `users` SET `avatar_file_name` = 'user1.jpg', `avatar_content_type` = 'image/jpeg', `avatar_file_size` = 39866, `avatar_updated_at` = '2017-04-16 07:53:53', `updated_at` = '2017-04-16 07:53:54' WHERE `users`.`id` = 1

  def update_password
    @user = User.find(current_user.id)
    if @user.update(user_pass_params)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `users` SET `encrypted_password` = '$2a$11$jrz0sEYrJqeneE1mPbQD4.wtykS09oKF9U3AvIDvm7PknG8YJ1EBK', `updated_at` = '2017-04-30 02:09:56' WHERE `users`.`id` = 3

  def import
    file = params[:file]
    nrc = params[:nrc]
    CSV.foreach(file.path, headers: true) do |row|
      student_hash = row.to_hash # exclude the price field
      student = User.where({email: student_hash["Email"]+'@uninorte.edu.co'})
      if(student.count == 1)
        studentinnrc = UserSubject.connection.execute("SELECT uf.name,uf.last_name from users as uf, user_subjects usub where (usub.user_id = "+student.first.id.to_s+" and usub.user_id = uf.id and usub.subject_id="+nrc.to_s+");")
        student.first.update_attributes(:name=>student_hash["Name"],:last_name=>student_hash["Last name"],:email =>student_hash["Email"]+'@uninorte.edu.co',:codigo=>student_hash["Codigo"])
        if(studentinnrc.count==1)
          puts("")
        else
          user_subject = UserSubject.connection.execute("INSERT INTO user_subjects (user_id,subject_id,created_at,updated_at) VALUES("+student.first.id.to_s+","+nrc.to_s+",now(),now())")
        end
      else
        generated_pass = rand(9999).to_s.center(4, rand(9).to_s)
        @user = User.create!({:name=>student_hash["Name"], :last_name =>student_hash["Last name"], :email =>student_hash["Email"]+'@uninorte.edu.co', :saldo =>'0', :codigo =>student_hash["Codigo"], :password => generated_pass})
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'luisdavidd@uninorte.edu.co' ORDER BY `users`.`id` ASC LIMIT 1
SELECT COUNT(*) FROM `users` WHERE `users`.`email` = 'luisdavidd@uninorte.edu.co'
INSERT INTO `users` (`name`, `last_name`, `codigo`, `email`, `encrypted_password`, `created_at`, `updated_at`) VALUES ('Sorelys', 'Sandoval', 200024783, 'sorelyss@uninorte.edu.co', '$2a$11$k/XCpSR3l.n4xygTmZUpp.4POCASlaguHFkXRczzdCU3/JYYgwrUi', '2017-04-21 06:18:32', '2017-04-21 06:18:32')

  def student_historics
    @users = User.where(teacher: '0').order('name')
---
SELECT `users`.* FROM `users` WHERE `users`.`teacher` = '0' ORDER BY name

  def transfer
    classes = Subject.all()
    @data = Hash.new
    i = 0
    classes_array = []
    nrc_array = []
    students_array = []
    students_id_array = []
    for clase in classes
      #class_name = clase.name
      classes_array.append(clase.name)
      nrcs = SubjectNrc.select("id, nrc").where('subject_id' => clase.id)
---
SELECT `subjects`.* FROM `subjects`
SELECT id, nrc FROM `subject_nrcs` WHERE `subject_nrcs`.`subject_id` = 1

  def newTransaction

    #params[:student].each_with_index do |user, i|
    user = params[:student]
      Transaction.create!({:user_id=>current_user.id, :user_to =>user, :amount =>params[:amount], :observations =>params[:observations], :nrc =>params[:nrc]})
---
INSERT INTO `transactions` (`user_id`, `user_to`, `amount`, `observations`, `nrc`, `created_at`, `updated_at`) VALUES (1, 0, 100.0, 'Segunda Consignación ', 0, '2017-04-30 11:24:58', '2017-04-30 11:24:58')